In [2]:
import pandas as pd

data = pd.read_csv('log.csv')

data.isna()

,Запись пользователя № - user_919,[2019-01-01 14:06:51,Unnamed: 2,Unnamed: 3
0,False,False,True,True
1,False,False,True,True
2,False,False,True,True
3,False,False,True,True
4,False,False,False,True
...,...,...,...,...
994,False,False,False,True
995,False,True,False,False
996,False,True,False,True
997,False,True,False,True
998,False,True,False,True

### Пропущенные значения

Посчитайте количество пропусков в столбце time. Метод isna() есть не только у DataFrame, но и у Series. Это значит, что применять его можно не только ко всей таблице, но и к каждому столбцу отдельно.

In [15]:
data = pd.read_csv('log.csv', header = None)
data.columns = ['user_id', 'time', 'bet', 'win']

len(data[data.time.isna()])

15

Удалите все столбцы, где есть пропуски. Запишите в поле, сколько осталось столбцов в данных после этого.

In [17]:
data.dropna(axis = 1)

                              user_id
0    Запись пользователя № - user_919
1    Запись пользователя № - user_973
2    Запись пользователя № - user_903
3    Запись пользователя № - user_954
4    Запись пользователя № - user_954
..                                ...
995  Запись пользователя № - user_984
996                            #error
997                            #error
998                            #error
999                            #error

[1000 rows x 1 columns]

Удалите все строки, где есть пропуски. Запишите в поле, сколько осталось строк в данных после этого.
Используйте оригинальный датасет log.csv.

In [19]:
data = pd.read_csv('log.csv', header = None)

data.dropna(axis = 0)

,0,1,2,3
14,Запись пользователя № - user_917,[2019-01-02 8:57:36,145732.0,1987653.0
29,Запись пользователя № - user_942,[2019-01-04 13:59:42,1678321.0,9876543.0
151,Запись пользователя № - user_982,[2019-01-16 21:54:22,100.0,4749.0
189,Запись пользователя № - user_964,[2019-01-21 18:34:44,200.0,4667.0
205,Запись пользователя № - user_931,[2019-01-22 5:26:59,300.0,4319.0
...,...,...,...,...
967,Запись пользователя № - user_975,[2019-04-19 22:25:15,1000.0,6108.0
971,Запись пользователя № - user_912,[2019-04-20 10:35:49,10554.0,31799.0
972,Запись пользователя № - user_926,[2019-04-20 10:35:50,10354.0,30244.0
976,Запись пользователя № - user_970,[2019-04-20 10:35:54,10354.0,30691.0
991,Запись пользователя № - user_965,[2019-04-20 12:55:41,800.0,6927.0

Используйте оригинальный датасет log.csv.

С данными в столбцах bet и win мы разберемся позже: пропуски в этих столбцах требуют особого подхода.

А сейчас:

если есть пропуски в столбце user_id - удалите столбец user_id,

если есть пропуски в столбце time - удалите столбец time.

Запишите в поле ответа, количество оставшихся столбцов в данных, после этих действий.

In [48]:
log = pd.read_csv('log.csv', header = None)
log.columns = ['user_id', 'time', 'bet', 'win']

for_drop = list(log[log.time.isna()]['time'].index) + list(log[log.user_id.isna()]['user_id'].index)

for_drop

log.dropna(axis = 1, subset = for_drop)

                              user_id
0    Запись пользователя № - user_919
1    Запись пользователя № - user_973
2    Запись пользователя № - user_903
3    Запись пользователя № - user_954
4    Запись пользователя № - user_954
..                                ...
995  Запись пользователя № - user_984
996                            #error
997                            #error
998                            #error
999                            #error

[1000 rows x 1 columns]

### Дубли


    import pandas as pd  
    df = pd.read_csv('data.csv')
    df.drop_duplicates()

Удалите дубли среди столбцов user_id и time. Запишите в поле ниже, сколько осталось строк после удаления дублей.

In [55]:
data = pd.read_csv('log.csv', header = None)
data.columns = ['user_id', 'time', 'bet', 'win']
data[(['user_id', 'time'])].drop_duplicates()

                              user_id                  time
0    Запись пользователя № - user_919  [2019-01-01 14:06:51
1    Запись пользователя № - user_973  [2019-01-01 14:51:16
2    Запись пользователя № - user_903  [2019-01-01 16:31:16
3    Запись пользователя № - user_954  [2019-01-01 17:17:51
4    Запись пользователя № - user_954  [2019-01-01 21:31:18
..                                ...                   ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41
992  Запись пользователя № - user_967  [2019-04-20 14:59:36
993  Запись пользователя № - user_973  [2019-04-20 17:09:56
994  Запись пользователя № - user_977  [2019-04-20 18:10:07
995  Запись пользователя № - user_984   [2019-04-20 9:59:58

[986 rows x 2 columns]

### Преобразование к datetime

Уберите лишний символ, преобразуйте признак time к datetime. После этого найдите наибольшую дату и выведите ее без времени.

Подсказка: можно применить метод max() к получившемуся столбцу со временем.

Не забудьте избавиться от пропусков.
Запишите ответ в формате "YYYY-MM-DD".

In [71]:
import datetime

data = pd.read_csv('log.csv', header = None)
data.columns = ['user_id', 'time', 'bet', 'win']

data = data.dropna(subset = ['time'])

data.time = data.time.apply(lambda x: x[1:])

data['time'] = pd.to_datetime(data['time'])  

data.time.max()

data.head()

                            user_id                time  bet  win
0  Запись пользователя № - user_919 2019-01-01 14:06:51  NaN  NaN
1  Запись пользователя № - user_973 2019-01-01 14:51:16  NaN  NaN
2  Запись пользователя № - user_903 2019-01-01 16:31:16  NaN  NaN
3  Запись пользователя № - user_954 2019-01-01 17:17:51  NaN  NaN
4  Запись пользователя № - user_954 2019-01-01 21:31:18  NaN  NaN

### Извлечение признаков времени

Используйте оригинальные данные log.csv, столбец time.

Подсказка: можно использовать value_counts().
Найдите минуту, которая встречалась в данных чаще всего.

In [74]:
data_min = data['time'].apply(lambda x: x.minute)
data_min.value_counts()

36    25
31    23
6     22
50    22
43    21
14    21
18    21
12    21
5     21
40    21
29    21
53    21
48    20
2     20
45    20
57    20
58    20
27    19
21    19
56    19
54    18
9     18
20    18
3     18
35    18
34    18
33    18
47    18
10    17
51    17
55    16
25    16
17    16
37    15
15    15
16    15
49    15
30    15
24    15
38    15
28    15
4     14
19    14
7     14
44    14
32    14
1     13
59    13
41    13
23    12
39    12
0     12
13    11
22    11
42    11
46    10
52    10
8      9
26     9
11     6
Name: time, dtype: int64

Используйте оригинальные данные log.csv, столбец time.

Подсказка: можно использовать value_counts().
Найдите месяц, который встречался в данных реже всего. Введите ответ в поле ниже.

In [75]:
data_month = data['time'].apply(lambda x: x.month)
data_month.value_counts()

1    292
3    264
2    259
4    170
Name: time, dtype: int64

Используйте оригинальные данные log.csv, столбец time.

Подсказка: можно использовать sum().
Посчитайте, сколько дней в данных являются выходными (то есть субботой или воскресеньем).

In [93]:
data_day = data['time'].apply(lambda x: x.weekday())
data_day = data_day.value_counts().reset_index()
data_day[(data_day.index == 5) | (data_day.index ==  6)]['time'].sum()

263

Используйте оригинальные данные log.csv, столбец time.

Подсказка: можно использовать value_counts(). Кроме этого, потребуется написать функцию, которая преобразует дату во время дня.

Договоримся, что с 0 до 5 часов - ночь, с 6 до 11 - утро, с 12 до 17 - день, с 18 до 23 - вечер.

Важно: для выполнения задания вам нужно будет избавиться от пропусков только в столбце time. Вспомните, как избавиться от пропусков только по конкретному признаку.
Посчитайте, какое время дня встречается в данных реже всего. Введите ответ в поле ниже: ночь, утро, день или вечер.

In [100]:
def toDay(x):
    night = [0, 5 * 3600, 'ночь']
    motning = [6 * 3600, 11 * 3600, 'утро']
    day = [12 * 3600, 17 * 3600, 'день']
    evening = [18 * 3600, 23 * 3600, 'вечер']
    
    time_lap = [night, motning, day, evening]
    
    time = x.hour * 3600 + x.minute * 60 + x.second
    
    for i in time_lap:
        if(time >= i[0] and time < i[1]):
            return i[2]
    

data_t = data['time'].apply(toDay)

data_t.value_counts()

ночь     220
утро     219
день     195
вечер    188
Name: time, dtype: int64

In [101]:
import datetime
import pandas as pd

log = pd.read_csv('log.csv', header = None)
log.columns = ['user_id', 'time', 'bet', 'win']

log = log.dropna(subset = ['time'])

log.time = log.time.apply(lambda x: x[1:])

log['time'] = pd.to_datetime(log['time'])  

log['hour'] = log['time'].apply(lambda x: x.hour)

log

,user_id,time,bet,win,hour
0,Запись пользователя № - user_919,2019-01-01 14:06:51,NaN,NaN,14
1,Запись пользователя № - user_973,2019-01-01 14:51:16,NaN,NaN,14
2,Запись пользователя № - user_903,2019-01-01 16:31:16,NaN,NaN,16
3,Запись пользователя № - user_954,2019-01-01 17:17:51,NaN,NaN,17
4,Запись пользователя № - user_954,2019-01-01 21:31:18,NaN,NaN,21
...,...,...,...,...,...
991,Запись пользователя № - user_965,2019-04-20 12:55:41,800.0,6927.0,12
992,Запись пользователя № - user_967,2019-04-20 14:59:36,10154.0,NaN,14
993,Запись пользователя № - user_973,2019-04-20 17:09:56,10254.0,NaN,17
994,Запись пользователя № - user_977,2019-04-20 18:10:07,10354.0,NaN,18
995,Запись пользователя № - user_984,2019-04-20 09:59:58,9754.0,NaN,9

### Снова смотрим на пропуски

Чтобы заполнить пропуски в столбце каким-то значением, можно использовать метод fillna() у самого столбца. Аргументом этого метода будет число, которое появится на месте пропусков.


    log['bet'].fillna(0)

Посчитайте, сколько раз люди приходили, но не делали ставок. Для этого заполните пропуски в столбце bet значением 0 и посчитайте количество таких значений.

In [107]:
data = pd.read_csv('log.csv', header = None)
data.columns = ['user_id', 'time', 'bet', 'win']
data.bet = data.bet.fillna(0)
data[data.bet == 0]

                              user_id                  time  bet  win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51  0.0  NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16  0.0  NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16  0.0  NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51  0.0  NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18  0.0  NaN
..                                ...                   ...  ...  ...
875  Запись пользователя № - user_967   [2019-04-08 1:25:56  0.0  NaN
876  Запись пользователя № - user_962  [2019-04-08 13:12:51  0.0  NaN
923  Запись пользователя № - user_956  [2019-04-14 10:53:09  0.0  NaN
977                            #error                   NaN  0.0  NaN
979                            #error                   NaN  0.0  NaN

[515 rows x 4 columns]

Посчитайте, сколько раз участники ставок проиграли деньги. То есть посчитайте количество строк, для которых в столбце win находится отрицательное значение.

In [ ]:
data = pd.read_csv('log.csv', header = None)
data.columns = ['user_id', 'time', 'bet', 'win']


    def fillna_win(row):  
        # Нужно дописать  
      
    # Применяем функцию  
    new_win = log.apply(lambda row: fillna_win(row), axis=1)  
      
    # Заменяем старый столбец с пропусками на новый без пропусков  
    log['win'] = new_win